#!/usr/bin/python

#Вывести на экран все делители числа n = 30

n = 30
i = 2
while i < n/2:
    if n%i == 0:
        print(i)
        print()
    i = i+1
    
    
    


 
