#!/usr/bin/python

#4 Написать функцию, «переворачивающую» строку
#справа налево (с использованием срезов!)


str = "stroka"

def naoborot(stroka):
      return print(stroka[::-1])

naoborot(str)
